src/Documents/СогласованиеПроектов/СогласованиеПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласованиеПроектов</name>
  <registerRecords>InformationRegister.УП_ОбщиеСведенияПоПроектам</registerRecords>
  <registerRecords>InformationRegister.УП_ВремяВыполнениеПроектов_План</registerRecords>
  <registerRecords>InformationRegister.ВремяВыполненияПроектов</registerRecords>
  <registerRecords>InformationRegister.ОбщиеДанныеПоПроектам</registerRecords>
  <registerRecords>InformationRegister.СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ИсполнителиПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СтоимостьПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектовИсполнителей</registerRecords>
  <registerRecords>InformationRegister.СтоимостьПроектов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПроекта</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнитьДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуетВРассылкеПоЭлектроннойПочте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/СогласованиеПроектов/Forms/ФормаДокумента/Module.bsl
#Область ПрочиеОбработчикиСобытий

&НаКлиенте
Процедура УстановитьИнформационнуюНадпись()
	
	ИнформационнаяНадпись = ПолучитьИнформационнуюНадписьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформационнуюНадписьНаСервере()
	
	Возврат "Количество согласованных проектов: " + Объект.Проекты.Количество() + ". На общую стоимость: " + Формат(Объект.Проекты.Итог("Сумма"), "ЧГ=0") + " руб.";
	
КонецФункции

&НаСервере
Процедура УстановитьКонтактноеЛицо_Сервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактныеЛица.Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.Владелец = &Владелец
	|	И КонтактныеЛица.Основной";
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект.КонтактноеЛицо = Выборка.Ссылка;
	КонецЦикла;
	
	Объект.Проекты.Очистить();
	Объект.Исполнители.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПроектыПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//// отменяем стандартное поведение при начале выбора
	//СтандартнаяОбработка = ложь;
	//// получим форму для выбора
	//Форма = ПолучитьФорму("Справочник.Проекты.ФормаВыбора");
	//// добавим отбор по владельцу
	//ЭлементОтбора                = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Контрагент");
	//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.Использование  = Истина;
	//ЭлементОтбора.ПравоеЗначение = Объект.Контрагент;
	//// укажем что форма для выбора
	//Форма.Параметры.РежимВыбора = Истина;
	//// укажем куда поместить значение выбора
	//Форма.ВладелецФормы = Элементы.ПроектыПроект;
	//// откроем форму
	//Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПроектПриИзменении(Элемент)
	
	УстановитьИнформационнуюНадпись();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// отменяем стандартное поведение при начале выбора
	СтандартнаяОбработка = ложь;
	// получим форму для выбора
	Форма = ПолучитьФорму("Справочник.КонтактныеЛица.ФормаВыбора");
	// добавим отбор по владельцу
	ЭлементОтбора                = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Контрагент;
	// укажем что форма для выбора
	Форма.Параметры.РежимВыбора = Истина;
	// укажем куда поместить значение выбора
	Форма.ВладелецФормы = Элементы.КонтактноеЛицо;
	// откроем форму
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьКонтактноеЛицо_Сервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьИнформационнуюНадпись();
	ИН_Дата = "необходимо указать дату согласования";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УП_РаботаСДокументамиСервер.Документ_ПриСозданииНаСервере(РеквизитФормыВЗначение("Объект"), ЭтотОбъект.Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Проекты.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ПараметрыСтруктуры = Новый Структура;
		ПараметрыСтруктуры.Вставить("Клиент", Элементы.Проекты.ТекущиеДанные.Клиент);
		ПараметрыСтруктуры.Вставить("Проект", Элементы.Проекты.ТекущиеДанные.Проект);
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура(ПараметрыСтруктуры);
		Элементы.Исполнители.ОтборСтрок = СтруктураОтбора;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Проекты.ТекущиеДанные = Неопределено ИЛИ Копирование Тогда
		//Нельзя назначить исполнителя для несуществующего проекта
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти        = Элементы.Исполнители.ТекущиеДанные;
		СтрокаТабличнойЧасти.Клиент = Элементы.Проекты.ТекущиеДанные.Клиент;
		СтрокаТабличнойЧасти.Проект = Элементы.Проекты.ТекущиеДанные.Проект;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыВремяВыполненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Проекты.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	УП_ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Объект, ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.Проекты.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьВалюту");
	
	УП_ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Объект, ТекущаяСтрока, СтруктураДействий);
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РуководительПроекта) Тогда
		ТекущаяСтрока.РуководительПроекта = ПолучитьРуководителяПроектовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРуководителяПроектовНаСервере()
	
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицо) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Исполнители.Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Исполнители КАК Исполнители
		|		ПО КонтактныеЛица.ФизическоеЛицо = Исполнители.ФизическоеЛицо
		|ГДЕ
		|	КонтактныеЛица.РуководительПроектов";
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Контрагент не заполнен";
		Сообщение.Поле = "Объект.Контрагент";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПроектыПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиВремяВыполненияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Исполнители.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуИсполнителя");
	
	УП_ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Объект, ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

#КонецОбласти
